# Задание 2: три числа

a1 = int(input("Введите первое число: "))
a2 = int(input("Введите второе число: "))
a3 = int(input("Введите третье число: "))
k = int(input("Выберите что посчитать (1 - максимум, 2 - минимум, 3 - среднее арифметическое): "))

m0 = 0
m1 = 0
if a1 > a2:
    if a1 > a3:
        m1 = a1
if a2 > a1:
    if a2 > a3:
        m1 = a2
if a3 > a1:
    if a3 > a2:
        m1 = a3
if a1 < a2:
    if a1 < a3:
        m0 = a1
if a2 < a1:
    if a2 < a3:
        m0 = a2
if a3 < a1:
    if a3 < a2:
        m0 = a3
s = (a1 + a2 + a3) / 3

if k == 1:
    print("Наибольшее число:", m1)
elif k == 2:
    print("Наименьшее число:", m0)
elif k == 3:
    print("Среднее арифмитическое трех чисел:", s)
else:
    print("Введена неверная команда")
