# Задание 1: цифры в числе

i = int(input("Введите десятизначное число: "))
m0 = 9
m1 = 0
while i > 0:
    u = i % 10
    if u < m0:
        m0 = u
    if u > m1:
        m1 = u
    i = i // 10

print("Наименьшая цифра:", m0)
print("Наибольшая цифра:", m1)
