# Задание 1 - список чисел

numbers = []
for _ in range(5):
    a = int(input("Введите число: "))
    numbers.append(a)

print(f"original: {numbers}")
