# Задание 2: таблица умножения

n = int(input("Введите число : "))
w = 1

while w <= 10:
    print(f"{n} * {w} = {n*w}")
    w = w + 1

