# Задание 7: факториал числа

n = int(input("Введите число: "))
w = 1
f = 1
while w <= n:
    f = f * w
    w = w + 1
print("Вывод: ",f)
