# Задание 3: обратный порядок

n = int(input("Введите число: "))
while n > 0:
    print(n, end=" ")
    n = n - 1
