# Задание 5: повтор строки

s = input("Введите: ")
n = int(input("Введите сколько раз надо вывести строку: "))
w = 0
while w < n:
    print(s)
    w = w + 1
