# Задание 1: таблица умножения

a1 = int(input("Введите число: "))
s = 0
n = 1
while s < 50:
    n = n + 1
    s = a1 * n
    print(a1, "*", n, "=", s)
