# Задание 4: удвоение числа

n = int(input("Введите число: "))
n2 = n * 2
print("Удвоенное число:", n2)
